Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: ལས་དང་འདུས་པའི་ཕྱིར་ལུས་ཞེས་བྱའོ། །
en: It is called the body because it is conjoined with karma.

source: ལུས་འདི་ནི་རིང་པོ་མི་ཐོགས་པར་མཐར་འགྱུར་ཞིང་འཕོ་བ་སྟེ་མི་རྟག་པ་ངེས་པ་མེད་པར་འགྱུར་བའི་མཚན་ཉིད་མེད་དོ། །
en: “This body will meet its end before long. It is fleeting, impermanent, and variable. It has no characteristics.

source: ལུས་འདི་ནི་ལུས་ཀྱི་ནང་ན་མི་གནས། ལུས་ཀྱི་ཕྱི་རོལ་ན་མི་གནས། དེ་གཉི་གའི་བར་ན་མི་གནས་སོ། །
en: The body does not exist inside the body, outside the body, or somewhere in-between.

source: ལུས་འདི་ནི་ལུས་སུ་མི་ཤེས་པ་ལུས་སུ་མི་མཐོང་ངོ་། །
en: This body is not understood or seen as the body.

source: ལུས་འདི་ནི་བྱེད་པ་མེད་པ། གཡོ་བ་མེད་པ། སྨོན་ཅིང་རེ་བ་མེད།
en: This body does not act, move, or form hopes or aspirations.

source: སེམས་མེད་དེ། རྡོ་དང་ཤིང་དང་ཐ་མི་དད་དོ། །
en: It has no mind, and is no different from stones and wood.

source: ལུས་འདི་ལ་ལུས་ཀྱི་མཚན་ཉིད་དུ་ངེས་པ་མེད་དོ། །
en: The body has no characteristics of a body that can be ascertained.

source: དེ་ལྟར་ཡང་དག་པར་ལུས་ལ་རྣམ་པར་འབྱེད་ཅིང་བརྟགས་ན་
en: If one genuinely discerns and investigates the body in this manner,

source: བྱས་པ་མེད། བྱེད་པ་མེད། ལུས་འདི་ལ་སྔ་མའི་མཐའ་མེད། ཕྱི་མའི་མཐའ་མེད། བར་གྱི་མཐའ་མེད་དོ། །
en: one will see that it is uncreated, has no agent, and has no past, no future, and no present.

source: ལུས་འདི་ལ་རྟག་པ། བརྟན་པ། སྲ་བའི་མཚན་གཅིག་ཀྱང་མེད།
en: This body does not have a single feature of permanence, stability, or solidity.

source: ཇི་ལྟར་ཆུའི་དབུ་བ་གཟུང་ཞིང་བཅང་དུ་མི་བཟོད་པ་བཞིན་ནོ། །
en: It is just like a water bubble that cannot withstand grabbing or grasping.

source: ལུས་འདི་ནི་སྲིན་བུ་བརྒྱད་ཁྲི་གནས་པའི་ཁྱིམ་མོ། །
en: This body is the home of eighty thousand worms.

source: ལུས་འདི་ནི་ལས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་འཚེ་བའོ། །
en: This body is harmed by all sorts of actions.

source: སྡུག་བསྔལ་རྣམ་པ་གསུམ་གྱི་ཕྱིར་ལུས་འདི་སྡུག་བསྔལ་བ་སྟེ།
en: This body suffers due to the three kinds of suffering.

source: མགོན་མེད་པས་ན་འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་དང་། འགྱུར་བའི་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་བའི་ཡང་སྡུག་བསྔལ་བས་རྣམ་པར་འཚེ་བས་ན་
en: Given that it is without protector, it is vulnerable to the suffering of being conditioned, the suffering of change, and the suffering of suffering. Thus,

source: སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་སྡུག་བསྔལ་བ་མང་པོའི་སྣོད་དོ། །
en: all these miseries make it a container for much suffering.

source: དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་རྟོགས་ནས་ཡང་འདི་སྙམ་དུ་ལུས་འདི་ནི་བདག་མ་ཡིན། གཞན་མ་ཡིན། དབང་མེད་པ། འདིར་རང་ཉམས་བྱར་མེད་པ། བྱས་པའོ་སྙམ་དུ་སེམས་སོ། །
en: “Having contemplated the body accurately in relation to the body, one will think, ‘The body is not the self. It is not something other. It is not independent or according to one’s own wishes. It is the production of a nonproduct.’

source: ལུས་འདི་ནི་དངོས་པོ་མེད་པ་ངེས་པའི་ཆོས་སུ་དམིགས་སུ་མེད་པའོ། །
en: ‘This body is insubstantial and is unobservable as a definite thing.

source: ལུས་འདི་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ་ངེས་པའི་མཚན་ཉིད་མེད་པའོ། །
en: This body is naturally empty, lacking any true characteristics.

source: ལུས་འདི་ནི་ཡང་དག་པ་མ་ཡིན་པ་ལས་བྱུང་བ་འཁྲུལ་འཁོར་ལས་བྱས་པ་ལྟ་བུ་སྟེ།
en: This body arises from falsity, like something created by a machine.

source: སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བས་ན་ལུས་འདི་ལ་ནི་བདག་དང་བདག་གི་ཞེས་འདུ་ཤེས་བསྐྱེད་པའི་མི་རིགས་ཏེ།
en: Because it occurs from the causes and conditions of past actions, it is inappropriate to generate the perception of the body as I or mine , for

source: བདག་ཅག་ཀྱང་ལུས་དང་སྲོག་ལ་མི་བལྟའོ་
en: we should not cherish our bodies and lives.’

source: སྙམ་དུ་མི་སེམས་སོ། །
en: One will also think,

source: བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་རྟོག་པའི་ཚེ་ལུས་འདི་དང་ལྷན་ཅིག་པའམ་སོ་སོ་བར་མི་དམིགས་ཏེ།
en: When bodhisattvas contemplate accurately in this fashion, they do not observe the body as coming together or separating.

source: གཞན་ནས་འོངས་པའམ། གུད་དུ་འགྲོ་བའི་གནས་ཡོད་པར་རམ་རྟེན་པའི་གནས་ཡོད་པར་མི་བལྟའོ། །
en: They do not see the body as coming from somewhere, going somewhere, or abiding anywhere.

source: ལུས་འདི་ལ་འདས་པའམ། མ་འོངས་པའམ། ད་ལྟར་གནས་པར་རྣམ་པར་མི་རྟོག་པས་
en: They do not think that this body exists in the past, present, or future. Thus,

source: ལུས་དང་སྲོག་ལ་མི་གནས། ལུས་ལ་བདག་གམ་བདག་གི་བར་མི་ཆགས་ཏེ།
en: they do not rely on the body or life-force, and they are not attached to the body as I or mine .

source: ལུས་སུ་འཛིན་པ་ཡོངས་སུ་སྤོང་ངོ་། །
en: They discard grasping to the body.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་དེ་ལྟར་ལུས་འདི་ལ་སྟོང་པ་ཉིད་དང་། བདག་མེད་པ། བདག་གི་བ་མེད་པར་ཡོངས་སུ་རྟོགས་ཏེ།
en: Such bodhisattvas realize this body to be emptiness, selfless, and unowned.

source: ལུས་འདི་ལ་བདག་དང་བདག་གི་བར་དམིགས་སུ་མེད་པས་ན་ལུས་ཀྱི་མཚན་ཉིད་དུ་མི་དམིགས་སོ། །
en: Because they do not observe this body as I or mine , they do not observe it as having physical characteristics.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་དེ་ལྟར་ལུས་ཀྱི་མཚན་ཉིད་དུ་མི་དམིགས་པས་ན་
en: Because such bodhisattvas do not observe the characteristics of the body,

source: ལུས་སུ་འཇུག་པ་ལ་རེ་བ་མེད་དེ་
en: they have no expectations of engaging the body, so

source: ལུས་བསྐྱེད་པའམ་འབྱུང་བའི་ལམ་མེད་དོ། །
en: there is no way for the body to be produced or arise.

source: དེ་འཇུག་པ་གང་ཞེ་ན།
en: What does engagement mean in this case?

source: ལུས་འདི་ལ་བྱས་པ་མེད། བྱུང་བ་མེད་པའོ། །
en: It is that the body lacks creation or arising.

source: ལུས་འདི་ནི་མ་བྱས་པ། མ་བྱུང་བའི་མཚན་ཉིད་པས་ན་
en: Because this body has the characteristic of being uncreated and unarisen,

source: རྒྱུ་དང་རྐྱེན་འདུས་པ་ལས་ལུས་སུ་གྱུར་ཏེ་
en: The body comes into being through the gathering of causes and conditions, yet

source: རྒྱུ་དང་རྐྱེན་ཡང་དག་པ་མ་ཡིན་པ། ཅི་ཡང་མེད་པ། ཕྱིན་ཅི་ལོག་དང་ལྡན་པ། སྟོང་པ་ཉིད། སྙིང་པོ་མེད་པ་སྟེ།
en: causes and conditions are false, nonexistent, mistaken, empty, and insubstantial.

source: རྒྱུ་དང་རྐྱེན་དེ་ལས་ལུས་འདི་སྐྱེས་པར་གྱུར་ཏོ། །
en: The body is born of such causes and conditions.

source: རྒྱུ་དང་རྐྱེན་ཉིད་སྐྱེ་བ་མེད་པ། མཚན་མ་མེད་པས་ན་
en: Because such causes and conditions themselves are unborn and without marks,

source: དེ་ལྟར་ལུས་ལ་རྟོག་པའི་ཚེ། ལུས་མ་སྐྱེས་པའི་མཚན་ཉིད་ལ་འཇུག་པར་འགྱུར་རོ། །
en: when one is contemplating the body in this way, one will understand that the body has the characteristic of being unborn.

source: དེ་ལྟར་ཞུགས་ནས་ལུས་ལ་མཚན་ཉིད་མེད་པར་རྟོག་གོ། །
en: Having applied oneself in this manner, one will realize how the body has no characteristics.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ལ་མཚན་ཉིད་མེད་པར་རྟོགས་པས་ན་
en: By correctly realizing how the body has no characteristics,

source: ལུས་འདི་ལ་མཚན་མ་མེད་པར་ཤེས་སོ། །
en: one will understand this body to be without marks.

source: མཚན་མར་དམིགས་སུ་མེད་པས་ན་སྐྱེ་བ་མེད་པར་ཤེས་སོ། །
en: Because there are no marks to observe, the body is understood to be unborn.

source: ལུས་འདི་ནི་འདས་པའི་མཚན་མའམ། མ་འོངས་པའི་མཚན་མའམ། ད་ལྟར་གྱི་མཚན་མར་དམིགས་སུ་མེད་དོ། །
en: “This body cannot be observed as having any marks of the past, marks of the present, or marks of the future.

source: ལུས་འདི་ལ་ངོ་བོ་ཉིད་དུ་ངེས་པའི་ཆོས་སུ་དམིགས་སུ་མེད་དེ་ལུས་འདི་ནི་བདག་དང་གཞན་དུ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: Because the body in essence has no definitive qualities to observe, and because the body cannot be observed as self or other.

source: དེ་ལྟར་ཡོངས་སུ་རྟོག་པ་ན་ལུས་འདི་གང་ནས་ཀྱང་མ་འོངས་ལ་གང་དུ་མི་འགྲོ་བར་ཤེས་ཏེ།
en: When contemplating this, one will understand how the body does not come from anywhere or go anywhere.

source: ལུས་འདི་མ་སྐྱེས་པ་དང་མི་འགག་པའི་ལམ་ལ་འཇུག་པར་འགྱུར་རོ། །
en: One will comprehend the nature of the body’s unborn and unceasing character.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་ལྟར་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་འཇུག་པ་ལ་ལུས་ཀྱི་རྗེས་སུ་འཇུག་པའི་ཡང་དག་པའི་མཚན་ཉིད་ལ་རྟོག་པ་ནི་ལུས་སུ་ཞེན་ཅིང་ཆགས་པ་ཡོངས་སུ་སེལ་ཅིང་ཆོད་པར་འགྱུར་ཏེདྲན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ལ་དེ་མ་ཐག་ཏུ་གནས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who thus contemplate the body in relation to the body and comprehend its true characteristics will dispel and disrupt any clinging or attachment to the body, thus causing their mindfulness to immediately settle upon the body in the proper manner.

source: དེ་དག་ནི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་རྟོག་པ་ལ་རྣལ་འབྱོར་པ་ཞེས་བྱའོ། །
en: They are then called practitioners who contemplate the body in relation to the body .”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་རྟོག་པ་ལ་རྣལ་འབྱོར་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings practice the contemplation of feelings in relation to feelings?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྡུག་བསྔལ་གྱི་ཚོར་བ་དང་། བདེ་བའི་ཚོར་བ་དང་། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་སྟེ་ཚོར་བ་གསུམ་པོ་ལ་རྟོག་པ་ན་
en: When bodhisattva great beings contemplate the three varieties of feelings—painful feelings, pleasurable feelings, and feelings that are neither painful nor pleasurable—

source: གང་ནས་ཀྱང་མ་འོངས་ལ། གང་དུ་འང་མི་འགྲོ་བར་རྟོགས་ཏེ
en: they understand that they do not come from anywhere or go anywhere.

source: ཡང་དག་པ་མ་ཡིན་པའི་རྐྱེན་དང་། སྔོན་གྱི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་དང་། ཕྱིན་ཅི་ལོག་དང་ལྡན་པའི་གཟུགས་བྱས་པར་ཤེས་སོ། །
en: They understand them to be propped up by false conditions and the ripened results of past actions, in conjunction with delusion.

source: ཚོར་བ་ལ་ཡང་དག་པ་མ་ཡིན་པའི་ལོག་པར་རྣམ་པར་རྟོག་པ་ལས་བྱུང་བར་ཤེས་སོ། །
en: They understand that feelings arise from false and inaccurate conceptuality.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཚོར་བ་རྣམས་ལ་རྟོག་པ་ན་འདས་པའི་ཚོར་བ་ལ་མི་དམིགས། མ་འོངས་པའི་ཚོར་བ་ལ་མི་དམིགས། ད་ལྟར་གྱི་ཚོར་བ་ལ་མི་དམིགས་སོ། །
en: When bodhisattvas contemplate feelings in this manner, they do not observe them as past feelings, present feelings, or future feelings.

source: བྱང་ཆུབ་སེམས་དཔའ་འདས་པའི་ཚོར་བ་རྣམས་ལ་སྟོང་པ་ཉིད་དང་། བདག་མེད་པ། བདག་གི་བ་མེད། མི་རྟག་པ། མི་བརྟན་པ། སྙིང་པོ་མེད་པ། མི་འགྱུར་བ། མཚན་ཉིད་མེད་པར་བལྟའོ། །
en: Bodhisattvas see past feelings as empty, selfless, unowned, impermanent, unstable, insubstantial, and without the characteristic of changelessness.

source: འདས་པའི་ཚོར་བ་ལ་ཡང་སྟོང་པའི་མཚན་ཉིད་དང་། ཞི་བའི་མཚན་ཉིད་དང་། མཚན་མ་མེད་པའི་མཚན་ཉིད་དུ་རྟོགས་སོ། །
en: They realize past feelings in terms of their characteristic of emptiness, characteristic of peace, and characteristic of being without marks.

source: མ་འོངས་པའི་ཚོར་བ་རྣམས་ལ་ཡང་སྟོང་པ་ཉིད་དང་། བདག་མེད་པ། བདག་གི་བ་མེད་པ། མི་རྟག་པ། མི་བརྟན་པ། སྙིང་པོ་མེད་པ། མི་འགྱུར་བ། མེད་པར་བལྟའོ། །
en: They also see future feelings as empty, selfless, unowned, impermanent, unstable, insubstantial, and without the characteristic of changelessness.

source: མ་འོངས་པའི་ཚོར་བ་རྣམས་ལ་ཡང་སྟོང་པའི་མཚན་ཉིད་དང་། ཞི་བའི་མཚན་ཉིད་དང་། མཚན་མ་མེད་པའི་མཚན་ཉིད་དུ་རྟོག་སོ། །
en: They understand future feelings in terms of their characteristic of emptiness, characteristic of peace, and characteristic of being without marks.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་རྟོག་པ་ན་འདི་སྙམ་དུ་ཚོར་བ་ནི་ངེས་པའི་མཚན་ཉིད་མེད་པ། དངོས་པོ་མེད་པ། གཅིག་ཏུ་ངེས་པའི་ཆོས་མེད་དེ་མི་འདྲ་བ་ལས་ཡང་དང་ཡང་སྐྱེ་ཞིང་འགོག་གོ་སྙམ་དུ་སེམས་སོ། །ཚོར་བ་ལ་གནས་པའི་དུས་མེད་དོ་སྙམ་དུ་སེམས་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདི་སྙམ་དུ་
en: “When bodhisattvas contemplate this, they think, ‘Feelings lack true characteristics, are insubstantial, and lack any fixed attributes. Since they are variegated, they continuously arise and subside, without ever remaining still.’ This leads bodhisattvas to think further,

source: ཚོར་བ་ནི་བྱས་པ་མེད། བྱེད་པ་མེད་དེ།
en: ‘Feelings are uncreated and lack an agent.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་དག་ཕྱིན་ཅི་ལོག་དང་ལྡན་པའི་སེམས་ལས་ཚོར་བ་རྣམ་པ་གསུམ་སྐྱེད་དེ།
en: The three varieties of feeling are generated from the minds of childish ordinary beings with mistaken perception.

source: དེ་ཡང་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་དང་ད་ལྟར་གྱི་རྐྱེན་འདུས་པ་ལས་ཚོར་བ་ཡོད་པར་གྱུར་ཏོ། །
en: These feelings owe their existence to the gathering of the causes of previous actions and concurrent conditions.

source: ཚོར་བ་ནི་ཀུན་ཀྱང་སྟོང་པ། མི་བརྟན་པ། སྙིང་པོ་མེད་པ། ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་ཉིད་དེ་ཁང་པ་སྟོང་པ་དང་མཚུངས་སོ། །
en: Feelings are all empty, unstable, insubstantial, and false by nature. They are like empty houses.’

source: དེ་ལྟར་ཡོངས་སུ་རྟོག་པའི་ཚེ་ཚོར་བ་མང་པོའི་རྒྱུ་ལས་སེམས་གཅིག་ཏུ་གནས་ཏེ།
en: “When contemplating in this way, the mind rests one-pointedly in the absence of feelings.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཚེ་ཚོར་བ་རྣམས་ལ་འདུས་ནས་འགག་པའི་མཚན་ཉིད་ཆུད་ཅིང་རྟོག་སྟེ་
en: At that moment, bodhisattvas understand and know all feelings in their characteristic of coalescing and subsiding, yet

source: ཚོར་བ་རྣམས་ལ་འདུས་པ་ཡང་མ་ཡིན་སོ་སོ་བ་ཡང་མ་ཡིན་པར་བལྟའོ། །
en: they also view feelings as neither coming together nor dispersing.

source: གཞན་ཡང་ཚོར་བའི་ནང་ན་ཚོར་བ་མི་མཐོང་སྟེ་འདི་སྙམ་དུ་ཚོར་བ་རྣམས་སྟོང་པ་ཉིད་དོ་སྙམ་དུ་སེམས་སོ། །
en: Moreover, they do not see feelings within feelings, but think, ‘Feelings are emptiness, because feelings are naturally empty.’

source: རང་བཞིན་སྟོང་པས་ཚོར་བ་རྣམས་ལ་མ་སྐྱེས་པའི་མཚན་ཉིད་དུ་རྟོགས་སོ། །
en: Thus they understand feelings as having the characteristic of being unborn.

source: ཚོར་བ་རྣམས་མ་སྐྱེས་པ་མི་འགོག་པས་གྲུབ་པའི་མཚན་ཉིད་མེད་པར་རྟོགས་སོ། །
en: Because feelings are unborn and unceasing, they understand that they lack any characteristic of having come into being.

source: དེ་ལྟར་ཚོར་བ་རྣམས་ཡིད་ལ་བྱེད་པར་ཆགས་པ་མེད་དོ། །
en: Thus, considering them, when they experience feelings, they are never attached to them.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚོར་བ་རྣམས་ཀྱི་མཚན་ཉིད་ཤེས་ཤིང་མཐོང་ངོ་། །
en: They accurately see and understand the characteristics of feelings.

source: ཚོར་བ་རྣམས་དང་བྲལ་ཏེ་ཚོར་བ་རྣམས་ལ་མི་གནས་པས་
en: Free from feelings, they do not dwell on feelings. Thus,

source: ཚོར་བ་རྣམས་སེམས་བཏང་སྙོམས་པར་འགྱུར་ཏེ།
en: their minds become equanimous concerning feelings, and

source: དེས་ན་བཏང་སྙོམས་ཀྱི་ཏིང་ངེ་འཛིན་ཡང་ཐོབ་པར་འགྱུར་རོ། །
en: thereby they attain the absorption of equanimity.

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་རྟོག་པ་གང་ལ་རྣལ་འབྱོར་པ་ཞེས་བྱའོ། །
en: Lokadhara, these bodhisattva great beings are called practitioners who contemplate feelings in relation to feelings .”

source: འཇིག་རྟེན་འཛིན་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་རྟོག་པ་ལ་རྣལ་འབྱོར་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings practice the contemplation of the mind in relation to the mind?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ལ་སྐྱེ་བ་དང་། འགོག་པ་དང་། གནས་པ་དང་། འཕོ་བའི་མཚན་ཉིད་དུ་ཡོངས་སུ་རྟོག་གོ། །
en: Bodhisattva great beings contemplate the mind in terms of the characteristics of arising, ceasing, remaining, and transitioning.

source: དེ་ལྟར་ཡོངས་སུ་རྟོག་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When they contemplate this, they think,

source: འདི་ནི་གང་ནས་ཀྱང་མ་འོངས་ལ། གང་དུ་ཡང་མི་འགྲོ་སྟེ།
en: ‘It does not come from anywhere. It does not go anywhere.

source: རྣམ་པར་ཤེས་པ་དང་རྐྱེན་ལས་སྐྱེས་པས་དངོས་པོ་མེད་དེ་ངེས་པའི་ཆོས་སུ་དམིགས་སུ་མེད་དོ་སྙམ་དུ་སེམས་སོ། །
en: Since it is born from consciousness and conditions, it is insubstantial and unobservable as any fixed quality.

source: སེམས་འདི་ནི་འོངས་པ་ཡང་མེད། སོང་བ་ཡང་མེད།
en: This mind does not come or go.

source: གནས་པའམ་འཕོ་བ་ཡང་དམིགས་སུ་མེད་དོ། །
en: It cannot be observed to remain or transition.

source: སེམས་འདི་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་དང་། ད་ལྟར་གྱི་མ་ཡིན་ཏེ།
en: This mind is neither past, present, nor future.

source: སེམས་འདི་ནི་རྣམ་པར་ཤེས་པ་དང་། རྐྱེན་དང་། རྣམ་པར་རྟོག་པ་ལས་སྐྱེས་སོ། །
en: This mind is born from consciousness, conditions, and thinking.

source: སེམས་ནི་ནང་ན་མི་གནས། ཕྱི་རོལ་ན་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་ཏེ།
en: This mind does not exist internally, externally, or somewhere in-between.

source: སེམས་འདི་ནི་སྐྱེ་ཞིང་འབྱུང་བའི་མཚན་མ་གཅིག་ཙམ་ཡང་མེད་པའོ། །
en: This mind lacks even a single mark of birth or arising.

source: སེམས་འདི་ནི་ངོ་བོ་ཉིད་མེད་པ། ངེས་པ་མེད་པ། སྐྱེད་པ་མེད་པ། སྐྱེས་པ་མེད་པ་སྟེ།
en: This mind lacks intrinsic nature, fixed identity, a creator, and anything created.

source: ལས་སྣ་ཚོགས་འབྱུང་བའི་ཕྱིར་སེམས་ཞེས་བྱའོ། །
en: We speak of something called the mind because of myriad actions.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་སྣ་ཚོགས་ལས་སེམས་ཞེས་བྱའོ། །
en: We speak of something called the mind based on myriad conditions of consciousness.

source: སྐད་ཅིག་སྐད་ཅིག་གིས་སྐྱེ་ཞིང་འགོག་པ་གཅིག་གིས་བསགས་པ་རྒྱུན་མི་འཆད་པས་སེམས་ཞེས་བྱ་སྟེ།
en: We speak of something called the mind based on thoughts arising and ceasing, moment by moment, in an unbroken continuity.

source: དེ་ནི་སོ་སོའི་སྐྱེ་བོ་དག་སེམས་ཀྱིས་མི་དམིགས་པའི་མཚན་ཉིད་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པར་བྱ་བའི་ཕྱིར་རོ། །
en: This description is given so that ordinary beings can understand and know the characteristic of the mind that cognizes objects.

source: སེམས་ལ་སེམས་ཀྱི་མཚན་ཉིད་མེད་དོ། །
en: The mind lacks the characteristic of mind.

source: སེམས་འདི་ནི་ཐོག་མ་ནས་མ་སྐྱེས་པ། མ་བྱུང་བ། ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པ་སྟེ།
en: This mind is primordially unborn, unarisen, and essentially pure.

source: བློ་བུར་གྱི་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་པ་རྣམ་པར་རྟོག་ཀྱང་སེམས་ཀྱིས་སེམས་མི་ཤེས་སེམས་མི་མཐོང་ངོ་། །
en: It has false concepts because of being defiled by adventitious afflictions. But the mind cannot understand or see itself.

source: སེམས་འདི་ནི་སྟོང་པ་ཉིད་དེ་སྟོང་པ་ཉིད་པས་ན་ངོ་བོ་ཉིད་མེད་པའོ། །
en: This mind is emptiness. Because it is emptiness, it is insubstantial.

source: སེམས་འདི་ནི་ངེས་པའི་ཆོས་ཅན་མ་ཡིན་ཏེ།
en: This mind does not possess a fixed quality,

source: ངེས་པའི་ཆོས་སུ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: because it is unobservable as any fixed quality, and

source: སེམས་འདི་ནི་གཅིག་དང་ཐ་དད་པའི་ཆོས་མེད་པའི་ཕྱིར་རོ། །
en: because this mind lacks the quality of being single or multiple.

source: སེམས་འདི་ནི་སྔ་མའི་མཐའ་ཡང་དམིགས་སུ་མེད་ལ་ཕྱི་མའི་མཐའ་ཡང་དམིགས་སུ་མེད་དེ་བར་གྱི་མཐའ་ཡང་དམིགས་སུ་མེད་དོ། །
en: This mind is unobservable in the past, present, or future.

source: སེམས་འདི་ནི་གཟུགས་མེད་དེ་མཐོང་བར་མི་ནུས་པས་
en: This mind is formless and invisible; thus,

source: སེམས་ཉིད་ཀྱིས་སེམས་མི་མཐོང་ལ་རང་བཞིན་མི་ཤེས་ཏེ།
en: the mind cannot see itself or know its own nature.

source: བུས་པ་སོ་སོའི་སྐྱེ་བོ་ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དག་ཡང་དག་པ་མ་ཡིན་པའི་རྐྱེན་དང་རྣམ་པར་ཤེས་པས་དམིགས་པའི་ཕྱིར་འབྱུང་ངོ་། །
en: It occurs simply because childish ordinary beings with mistaken perception make observations via false conditions and consciousness.

source: སེམས་འདི་ནི་སྟོང་པ་ཉིད་དེ་བདག་མེད་པ། བདག་གི་བ་མེད་པ། མི་རྟག་པ། མི་བརྟན་པ། སྙིང་པོ་མེད་པ། མི་འགྱུར་བའི་ཆོས་ཅན་མ་ཡིན་པའོ། །
en: This mind is emptiness; it is selfless, unowned, impermanent, unstable, insubstantial, and does not have the quality of changelessness.’

source: ད་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ན།
en: When one thinks and contemplates in this way,

source: སེམས་ཀྱི་དྲན་པ་ཉེ་བར་གཞག་པ་འཐོབ་སྟེ།
en: one will accomplish the application of mindfulness related to the mind.

source: གང་ཟག་དེ་དེའི་ཚེ་ན་སེམས་སམ། སེམས་མ་ཡིན་པར་རྣམ་པར་མི་རྟོག་སྟེ།
en: “At such a time, one does not wonder whether something is the mind or not.

source: སེམས་ལ་མ་སྐྱེས་པའི་མཚན་ཉིད་དུ་ལེགས་པར་ཤེས་པས་སེམས་མ་སྐྱེས་པ་ཉིད་དུའང་རྟོགས་སོ། །
en: Instead, one will understand that the mind has the characteristic of being unborn, thereby realizing the mind to be unborn.

source: སེམས་ལ་ངེས་པའི་རང་བཞིན་མེད་དེ། ངེས་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་རོ། །
en: Because the mind has no real nature or true characteristics.

source: མཁས་པ་དག་ནི་དེ་ལྟར་སེམས་ལ་མ་སྐྱེས་པ་དང་། མཚན་ཉིད་མེད་པར་ཆུད་ཅིང་རྟོགས་སོ། །
en: The wise understand and realize how the mind is unborn and lacks characteristics in this way.

source: དེའི་ཚེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཀྱི་འདུས་པ་དང་འགོག་པའི་མཚན་ཉིད་རྟོགས་ཏེ།
en: At that moment, they accurately understand the mind’s characteristics of forming and subsiding.

source: དེ་ལྟར་རྟོགས་པ་ན་སེམས་ལ་ཀུན་འབྱུང་ངམ་འགོག་པའི་མཚན་ཉིད་མ་རྙེད་དོ། །
en: When understanding this, no characteristics of origination or cessation can be found in the mind.

source: སེམས་ལ་འགོག་པའམ་མི་འགོག་པར་རྣམ་པར་མི་རྟོག་པའི་སེམས་ཀྱི་དེ་བཞིན་ཉིད་རྣམ་པར་དག་པའི་མཚན་ཉིད་ཐོབ་པར་འགྱུར་རོ། །
en: They will attain the characteristic of the pure nature of mind that is free from considering the mind as ceasing or not ceasing.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ལྟར་སེམས་རྣམ་པར་དག་པས་ན་བློ་བུར་གྱི་ཉོན་མོངས་པས་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །
en: Because bodhisattvas’ minds are pure in this way, they are not defiled by adventitious afflictions.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བདག་གི་སེམས་རྣམ་པར་དག་པ་ཉིད་དུ་ཤེས་ཤིང་མཐོང་བས་སེམས་ཅན་དག་གི་སེམས་ཀྱང་རྣམ་པར་དག་པར་ཤེས་ཏེ་སྙམ་དུ་སེམས་སོ། །སེམས་དྲི་མ་ཡོད་པས་ན། སེམས་རྣམ་པར་དག་པས་ན་སེམས་ཅན་ཡང་རྣམ་པར་དག་པའོ་སྙམ་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ན་སེམས་ལ་དྲི་མའི་མཚན་ཉིད་དམ། སེམས་ལ་རྣམ་པར་དག་པའི་མཚན་ཉིད་དུ་མི་དམིགས་ཏེ
en: Bodhisattvas who see and know their own minds to be pure, thereby know that other beings’ minds are pure too, and thus they think the following: ‘When the mind is stained, beings are stained. When the mind is pure, beings are pure.’ As they consider this, they do not observe the mind to be characterized as stained or pure.

source: སེམས་ཉིད་རྟག་ཏུ་རྣམ་པར་དག་པའི་མཚན་ཉིད་དུ་ཤེས་སོ། །
en: They know that the mind as such perpetually has the characteristic of purity.”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་རྟོག་པ་ལ་རྣལ་འབྱོར་པ་ཞེ་ན།
en: “Lokadhara, how do bodhisattva great beings practice the contemplation of mental phenomena in relation to mental phenomena?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཐམས་ཅད་ལ་ནང་ངམ། ཕྱི་རོལ་ལམ། གཉི་གའི་བར་ན་ཡོད་པར་མི་རྟོག་གོ། །
en: Bodhisattvas do not think that any mental phenomenon exists internally, externally, or somewhere in-between.

source: གཞན་ཡང་ཆོས་ལ་འདས་པའམ། མ་འོངས་པའམ། ད་ལྟར་གྱིར་མི་དམིགས་ཏེ་
en: Moreover, they do not observe mental phenomena to be past, present, or future.

source: ཆོས་ཐམས་ཅད་རྐྱེན་མང་པོ་ལས་སྐྱེས་ཏེ། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བའི་ངེས་པའི་མཚན་ཉིད་མེད་པའོ། །
en: All mental phenomena arise from many conditions, are rooted in mistaken perception, and have no true characteristics.

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་གང་ཟག་དབང་པོ་ཞེས་བྱ་བ་དང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཅེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་ཆོས་ཞེས་བྱ་བ་མེད་དེ།
en: That is to say, all mental phenomena are subject to the person. As for the basic nature of mental phenomena, all mental phenomena are devoid of mental phenomena.

source: ཆོས་རྣམས་ནི་ཆོས་རྣམས་ཀྱི་ནང་ན་མི་གནས། ཆོས་རྣམས་ཀྱི་ཕྱི་རོལ་ན་མི་གནས། གཉི་གའི་བར་ན་མི་གནས་སོ། །
en: Mental phenomena do not exist inside mental phenomena, outside mental phenomena, or somewhere in-between.

source: ཆོས་ནི་ཆོས་དང་ལྷན་ཅིག་པའང་མ་ཡིན། སོ་སོ་བ་ཡང་མ་ཡིན་ཏེ།
en: Mental phenomena neither conjoin with nor separate from mental phenomena.

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངེས་པའི་མཚན་ཉིད་མེད་པའོ། །
en: Mental phenomena are insubstantial and lack true characteristics.

source: ཆོས་ཐམས་ཅད་ཡོད་པ་མ་ཡིན་པས་ན། གཡོ་བ་མེད་བྱས་པ་མེད་དོ། །
en: Because mental phenomena do not exist, they are unmoving and uncreated.

source: ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུ་སྟེ་ཅི་ཡང་མེད་པའོ། །
en: All mental phenomena are like space in being nonexistent.

source: ཆོས་ཐམས་ཅད་ནི་སླུ་བའི་ཆོས་ཅན་སྒྱུ་མ་ལྟ་བུ། སྒྱུ་མའི་མཚན་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །
en: All mental phenomena are deceptive and illusory, because the characteristic of illusion is unobservable.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པ་སྟེ།
en: Mental phenomena are pure,

source: ཅིས་ཀྱང་མ་གོས་པའི་ཕྱིར་རོ། །
en: because they are unstained by anything at all.

source: ཆོས་ཐམས་ཅད་ནི་མི་ལེན་པའི་མཚན་ཉིད་དེ།
en: Mental phenomena have the characteristic of being beyond appropriation,

source: ལེན་པ་མེད་པའི་ཕྱིར་རོ། །
en: because there is no appropriation.

source: ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ་སྟེ།
en: Mental phenomena are dreamlike,

source: རྨི་ལམ་ཉིད་མེད་པའི་ཕྱིར་རོ། །
en: because dreams are nonexistent.

source: ཆོས་ཐམས་ཅད་ནི་གཟུགས་མེད་པ་སྟེ།
en: Mental phenomena are formless,

source: གཟུགས་ཅི་ཡང་མེད་པའི་ཕྱིར་རོ། །
en: because form is totally nonexistent.

source: ཆོས་ཐམས་ཅད་གཟུགས་བརྙན་ལྟ་བུ་སྟེ།
en: Mental phenomena are like reflections,
